---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.SummaryShowsOnlyConnectedLoads
source: html/e259c5ea-cfac-5e82-e147-3fab28f2a21d.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.SummaryShowsOnlyConnectedLoads Property

Show only the connected load classifications in the summary section

## Syntax (C#)
```csharp
public bool SummaryShowsOnlyConnectedLoads { get; set; }
```